// Завдання з класами:

// Створити клас "Книга" з властивостями, такими як назва, автор і рік видання.
// Забезпечте клас методом, який дозволить вивести інформацію про книгу в консоль.
// Створити екземпляр класу "Книга" і викликати метод для виведення інформації про цю книгу.
let myBook = {
    title: "Франц Кафка Письма Мілені",
    author: "Франц Кафка ",
    year: 2011,
    getInfoAboutbook: function() {
      console.log("Назва: " + myBook.title + ", Автор: " + myBook.author + ", Рік видання: " + myBook.year);
    }
  };
  
  myBook.getInfoAboutbook(); 
// Завдання з успадкуванням:
// Створити клас "Тварина" з властивостями, такими як назва і звук, а також методом,
// який виводить повідомлення про звук тварини.
// Створити клас "Собака", який успадковує від класу "Тварина" і має додаткову властивість - порода собаки.
// Забезпечте клас "Собака" методом, який виводить повідомлення про звук собаки, додавши в нього породу.
// Створити екземпляр класу "Собака" і викликати метод для виведення повідомлення про звук собаки з породою.
class Animal {
  
    makeSound(name, sound) {
      console.log(name + " робить звук: " + sound);
    }
  }

  class Dog {
   
    makeSound(name, sound, breed) {
      console.log("Собака породи " + breed + " робить звук: " + sound);
    }
  }
  

  let animal = new Animal();
  animal.makeSound("Тварина", "звук"); 
  
  
  let dog = new Dog();
  dog.makeSound("Чокопай", "гав-гав-гав", "мопс"); 
// Завдання з поліморфізмом:
// Створити клас "Фігура" з методом "відображення", який просто виводить повідомлення "Це фігура".
// Створити класи "Прямокутник" і "Коло",які успадковують від класу "Фігура" і мають свої методи "відображення",
// які виводять повідомлення "Це прямокутник" і "Це коло" відповідно.
// Створити масив об'єктів різних фігур (прямокутники, кола) і викликати метод "відображення" для кожного елемента масиву.
// Побачите, як кожна фігура виводить відповідне повідомлення, не залежно від свого типу.

class Shape {
    display() {
        console.log('Це фігура');
    }
}


class Rectangle extends Shape {
    display() {
        console.log('Це прямокутник');
    }
}


class Circle extends Shape {
    display() {
        console.log('Це коло');
    }
}


const shapes = [new Rectangle(), new Circle()];


shapes.forEach(shape => shape.display());





// ______________________________________________________________________________________________________________________________________________________
//                                                                     Додатково
// ______________________________________________________________________________________________________________________________________________________

// - Створити клас який дозволяє створювати об'єкти car, з властивостями модель, виробник, рік випуску, максимальна швидкість, об'єм двигуна. додати в об'єкт функції:
// -- drive () - яка виводить в консоль "їдемо зі швидкістю {максимальна швидкість} на годину"
// -- info () - яка виводить всю інформацію про автомобіль
// -- increaseMaxSpeed (newSpeed) - яка підвищує значення максимальної швидкості на значення newSpeed
// -- changeYear (newValue) - змінює рік випуску на значення newValue
// -- addDriver (driver) - приймає об'єкт який "водій" з довільним набором полів, і доавляет його в поточний об'єкт car


// -створити класс попелюшка з полями ім'я, вік, розмір ноги
// --Створити 10 попелюшок , покласти їх в масив
// --Сторити об'єкт класу "принц" за допомоги класу який має поля ім'я, вік, туфелька яку він знайшов.
// -- за допоиоги циклу знайти яка попелюшка повинна бути з принцом
// -- Додати принцу функцію "пошук попелюшки"
// -- функція повинна приймати масив попелюшок, та шукає ту котра йому підходить